In [1]:
import sqlite3

db = "emp.db"

conn = sqlite3.connect(db)

print ("Opened database successfully")

Opened database successfully

In [2]:
import sqlite3

conn = sqlite3.connect(db)
print ("Opened database successfully")

conn.execute('''CREATE TABLE COMPANY
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         SALARY         REAL);''')
print ("Table created successfully")

conn.close()

Opened database successfully
Table created successfully

In [3]:
import sqlite3

conn = sqlite3.connect(db)
print ("Opened database successfully")

conn.execute("INSERT INTO COMPANY VALUES (1, 'Paul', 32, 'California', 20000.00 )");

conn.execute("INSERT INTO COMPANY VALUES (2, 'Allen', 25, 'Texas', 15000.00 )");

conn.execute("INSERT INTO COMPANY VALUES (3, 'Teddy', 23, 'Norway', 20000.00 )");

conn.execute("INSERT INTO COMPANY VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00 )");

conn.execute("INSERT INTO COMPANY VALUES (5, 'David', 27, 'Texas ', 85000.0 )");

conn.execute("INSERT INTO COMPANY VALUES (6, 'Kim', 22, 'South-Hall ', 45000.0 )");

conn.execute("INSERT INTO COMPANY VALUES (7, 'James', 24, 'Houston ', 10000.0)");

conn.commit()
print ("Records created successfully")
conn.close()

Opened database successfully
Records created successfully

In [4]:
import sqlite3 as lite

con = lite.connect(db)

with con:

    cur = con.cursor()
    cur.execute("SELECT * FROM COMPANY")

    rows = cur.fetchall()

    for row in rows:
        print (row)

(1, 'Paul', 32, 'California', 20000.0)
(2, 'Allen', 25, 'Texas', 15000.0)
(3, 'Teddy', 23, 'Norway', 20000.0)
(4, 'Mark', 25, 'Rich-Mond ', 65000.0)
(5, 'David', 27, 'Texas ', 85000.0)
(6, 'Kim', 22, 'South-Hall ', 45000.0)
(7, 'James', 24, 'Houston ', 10000.0)

In [5]:
import pandas as pd

con = sqlite3.connect(db)

df_employees = pd.read_sql_query('SELECT * FROM COMPANY', con)

df_employees

   ID   NAME  AGE      ADDRESS   SALARY
0   1   Paul   32   California  20000.0
1   2  Allen   25        Texas  15000.0
2   3  Teddy   23       Norway  20000.0
3   4   Mark   25   Rich-Mond   65000.0
4   5  David   27       Texas   85000.0
5   6    Kim   22  South-Hall   45000.0
6   7  James   24     Houston   10000.0

In [6]:

df_employees_5 = df_employees[:5]

df_employees_5.to_sql("surveys_5", con, if_exists="replace")

5

In [7]:
import sqlite3 as lite

con = lite.connect(db)

with con:

    cur = con.cursor()
    cur.execute("SELECT * FROM surveys_5")

    rows = cur.fetchall()

    for row in rows:
        print (row)

(0, 1, 'Paul', 32, 'California', 20000.0)
(1, 2, 'Allen', 25, 'Texas', 15000.0)
(2, 3, 'Teddy', 23, 'Norway', 20000.0)
(3, 4, 'Mark', 25, 'Rich-Mond ', 65000.0)
(4, 5, 'David', 27, 'Texas ', 85000.0)